<a href="https://colab.research.google.com/github/smoscoso/CitaFacil/blob/master/CIENCIA_DE_DATOS1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.0.0-cp310-cp310-manylinux_2_17_x86_64.whl.metadata (2.0 kB)
Downloading mysql_connector_python-9.0.0-cp310-cp310-manylinux_2_17_x86_64.whl (19.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 19.3/19.3 MB 4.8 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.0.0

In [ ]:

import mysql.connector

# connect db
conexion = mysql.connector.connect(
    host="3.21.236.8",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()


# query
cursor.execute("SHOW TABLES")
tablas = cursor.fetchall()

for tabla in tablas:
    nombre_tabla = tabla[0]
    print(f"Consultando tabla: {nombre_tabla}")

    consulta = f"SELECT * FROM {nombre_tabla} LIMIT 5"
    cursor.execute(consulta)
    resultados = cursor.fetchall()

    # print
    for fila in resultados:
        print(fila)
    print("-" * 30)

conexion.close()

Consultando tabla: current_dept_emp
(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))
(10002, 'd007', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1))
(10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1))
(10004, 'd004', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1))
(10005, 'd003', datetime.date(1989, 9, 12), datetime.date(9999, 1, 1))
------------------------------
Consultando tabla: days_off
------------------------------
Consultando tabla: departments
('d009', 'Customer Service')
('d005', 'Development')
('d002', 'Finance')
('d003', 'Human Resources')
('d001', 'Marketing')
------------------------------
Consultando tabla: dept_emp
(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))
(10002, 'd007', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1))
(10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1))
(10004, 'd004', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1))
(10005, 'd003', datetime.date(1989, 9, 12), datetime.date(9999, 1, 1))
------------------------------
Consultando tabla: dept_emp_latest_date
(10001, datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))
(10002, datetime.date(1996, 8, 3), datetime.date(9999, 1, 1))
(10003, datetime.date(1995, 12, 3), datetime.date(9999, 1, 1))
(10004, datetime.date(1986, 12, 1), datetime.date(9999, 1, 1))
(10005, datetime.date(1989, 9, 12), datetime.date(9999, 1, 1))
------------------------------
Consultando tabla: dept_manager
(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))
(110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))
(110085, 'd002', datetime.date(1985, 1, 1), datetime.date(1989, 12, 17))
(110114, 'd002', datetime.date(1989, 12, 17), datetime.date(9999, 1, 1))
(110183, 'd003', datetime.date(1985, 1, 1), datetime.date(1992, 3, 21))
------------------------------
Consultando tabla: employees
(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))
(10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))
(10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28))
(10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))
(10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12))
------------------------------
Consultando tabla: salaries
(10009, 60929, datetime.date(1985, 2, 18), datetime.date(1986, 2, 18))
(10013, 40000, datetime.date(1985, 10, 20), datetime.date(1986, 10, 20))
(10048, 40000, datetime.date(1985, 2, 24), datetime.date(1986, 2, 24))
(10064, 40000, datetime.date(1985, 11, 20), datetime.date(1986, 11, 20))
(10070, 55999, datetime.date(1985, 10, 14), datetime.date(1986, 10, 14))
------------------------------
Consultando tabla: titles
(10009, 'Assistant Engineer', datetime.date(1985, 2, 18), datetime.date(1990, 2, 18))
(10013, 'Senior Staff', datetime.date(1985, 10, 20), datetime.date(9999, 1, 1))
(10048, 'Engineer', datetime.date(1985, 2, 24), datetime.date(1987, 1, 27))
(10064, 'Staff', datetime.date(1985, 11, 20), datetime.date(1992, 3, 2))
(10070, 'Technique Leader', datetime.date(1985, 10, 14), datetime.date(9999, 1, 1))
------------------------------

In [ ]:

import mysql.connector
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)

cursor = conexion.cursor()


consulta = "SELECT * FROM departments ORDER BY dept_name ASC"


cursor.execute(consulta)

resultados = cursor.fetchall()

for fila in resultados:
    print(fila)

cursor.close()
conexion.close()

('d009', 'Customer Service')
('d005', 'Development')
('d002', 'Finance')
('d003', 'Human Resources')
('d001', 'Marketing')
('d004', 'Production')
('d006', 'Quality Management')
('d008', 'Research')
('d007', 'Sales')

In [ ]:

!pip install names
import mysql.connector
import names

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Create table
cursor.execute("CREATE TABLE IF NOT EXISTS puto_el_que_lo_lea (id INT PRIMARY KEY, nombre VARCHAR(255))")

# Insert data
for i in range(1, 11):  # Inserting 10 records
    nombre_aleatorio = names.get_full_name()
    cursor.execute("INSERT INTO puto_el_que_lo_lea (id, nombre) VALUES (%s, %s)", (i, nombre_aleatorio))

conexion.commit()  # Commit the changes to the database

print("Tabla creada y datos insertados exitosamente.")

cursor.close()
conexion.close()

Requirement already satisfied: names in /usr/local/lib/python3.10/dist-packages (0.3.0)
Tabla creada y datos insertados exitosamente.

In [ ]:

import mysql.connector

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Listar todas las tablas
cursor.execute("SHOW TABLES")
tablas = cursor.fetchall()

print("Tablas en la base de datos:")
for tabla in tablas:
    print(tabla[0])

cursor.close()
conexion.close()

Tablas en la base de datos:
current_dept_emp
days_off
departments
dept_emp
dept_emp_latest_date
dept_manager
empleados
employees
numeros_nombres
puto_el_que_lo_lea
salaries
titles

In [ ]:
import mysql.connector


# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Cambiar el primer nombre
nuevo_nombre = names.get_first_name()
cursor.execute("UPDATE numeros_nombres SET nombre = %s WHERE id = 1", ("Daniel",))
conexion.commit()

# Imprimir la tabla
cursor.execute("SELECT * FROM numeros_nombres")
resultados = cursor.fetchall()

for fila in resultados:
    print(fila)

cursor.close()
conexion.close()
print("Primer nombre actualizado e impreso la tabla.")

(1, 'Daniel')
(2, 'Elbert Gentsy')
(3, 'Bradly Wilson')
(4, 'Marcia Wood')
(5, 'David Dam')
(6, 'Krystal Robinson')
(7, 'Mary Dixon')
(8, 'Bonnie Canclini')
(9, 'Robert Ohmen')
(10, 'Charles Hines')
Primer nombre actualizado e impreso la tabla.

In [ ]:

import mysql.connector

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Obtener columnas de la tabla 'salaries'
cursor.execute("SHOW COLUMNS FROM salaries")
columnas = cursor.fetchall()

print("Columnas de la tabla 'salaries':")
for columna in columnas:
    print(columna[0])  # Imprime el nombre de la columna

cursor.close()
conexion.close()

Columnas de la tabla 'salaries':
emp_no
salary
from_date
to_date

In [ ]:
!pip install mysql-connector-python
import mysql.connector
from tabulate import tabulate

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Obtener columnas y datos de la tabla 'salaries'
cursor.execute("SELECT * FROM salaries LIMIT 10")  # Limitamos a 10 filas para ejemplo
resultados = cursor.fetchall()

# Obtener nombres de columnas
column_names = [desc[0] for desc in cursor.description]

# Imprimir tabla usando tabulate
print(tabulate(resultados, headers=column_names, tablefmt="grid"))

cursor.close()
conexion.close()

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.10/dist-packages (9.0.0)
+----------+----------+-------------+------------+
|   emp_no |   salary | from_date   | to_date    |
+==========+==========+=============+============+
|    10009 |    60929 | 1985-02-18  | 1986-02-18 |
+----------+----------+-------------+------------+
|    10013 |    40000 | 1985-10-20  | 1986-10-20 |
+----------+----------+-------------+------------+
|    10048 |    40000 | 1985-02-24  | 1986-02-24 |
+----------+----------+-------------+------------+
|    10064 |    40000 | 1985-11-20  | 1986-11-20 |
+----------+----------+-------------+------------+
|    10070 |    55999 | 1985-10-14  | 1986-10-14 |
+----------+----------+-------------+------------+
|    10098 |    40000 | 1985-05-13  | 1986-05-13 |
+----------+----------+-------------+------------+
|    10126 |    40000 | 1985-09-08  | 1986-09-08 |
+----------+----------+-------------+------------+
|    10133 |    40000 | 1985-12-15  | 1986-12-15 |
+----------+----------+-------------+------------+
|    10137 |    40000 | 1985-02-18  | 1986-02-18 |
+----------+----------+-------------+------------+
|    10144 |    56720 | 1985-10-14  | 1986-10-14 |
+----------+----------+-------------+------------+

In [ ]:

import mysql.connector

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

emp_no = 10009
cursor.execute("DELETE FROM salaries WHERE emp_no = %s", (emp_no,))
conexion.commit()  # Confirmar los cambios en la base de datos

print(f"Empleado {emp_no} eliminado de la tabla 'salaries'")

cursor.close()
conexion.close()

Empleado 10009 eliminado de la tabla 'salaries'

Uso de pandas

In [ ]:
!pip install mysql-connector-python pandas
import mysql.connector
import pandas as pd

# connect db
conexion = mysql.connector.connect(
    host="18.116.82.240",
    user="studentsucundi",
    password="mami_prende_la_radi0",
    port="3306",
    database="employees"
)
cursor = conexion.cursor()

# Obtener datos de la tabla 'salaries'
cursor.execute("SELECT * FROM salaries")
resultados = cursor.fetchall()

# Crear DataFrame de Pandas
df = pd.DataFrame(resultados, columns=[desc[0] for desc in cursor.description])

cursor.close()
conexion.close()

# Calcular salario promedio por año
salario_promedio_por_año = df.groupby('from_date')['salary'].mean()
print(salario_promedio_por_año)

# Encontrar el salario máximo y mínimo
salario_maximo = df['salary'].max()
salario_minimo = df['salary'].min()
print("Salario máximo:", salario_maximo)
print("Salario mínimo:", salario_minimo)

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.10/dist-packages (9.0.0)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.22.4 in /usr/local/lib/python3.10/dist-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
from_date
1985-01-01    57290.777778
1985-01-14    52070.000000
1985-02-01    50292.375000
1985-02-02    51036.518519
1985-02-03    51244.147541
                  ...
2002-07-30    73340.823620
2002-07-31    73195.647910
2002-08-01    73286.002972
2005-11-15    75000.000000
2024-08-03    75000.000000
Name: salary, Length: 6394, dtype: float64
Salario máximo: 158220
Salario mínimo: 38623